// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

//const number = Number(prompt(`Enter number`));
//const number = +prompt(`Enter number`);
//console.log(number);

//if (number === 10) {
//   alert("Вірно");
//} else {
//   alert("Невірно");
//}

//alert(number === 10 ? "Вірно" : "Невірно");33

//const value = confirm(`Are you here?`);
//console.log(value);

//Task 2

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);


//const min = 55;

//if (min <= 15) {
//   alert("Перша");
//} else if (min <= 30) {
//   alert("Друга");
//}
//else if (min <= 45) {
//   alert("Третя");
//} else if (min <= 60) {
//   alert("Четверта");
//}

//console.log(min);

//Task 3


// Змінна num може набувати 4 значення: '1', '2', '3' або '4' 
// (запитуй це значення у користувача через prompt). 
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач 
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

   
let num = prompt("Введіть число від 1 до 4:");
let result;

switch (num) {
  case '1':
    result = 'зима';
    break;
  case '2':
    result = 'весна';
    break;
  case '3':
    result = 'літо';
    break;
  case '4':
    result = 'осінь';
    break;
  default:
    result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
}

console.log(result);