// Потрібно створити функціонал для отримання прогнозу погоди в місті
// Використай публічне API https://www.weatherapi.com/docs/

// Використовуй ендпоінт Forecast для того, щоб отримати прогноз погоди

// Створи форму, в яку користувач:
// 1. Вводить назву міста.
// 2. Обирає, на яку кількість днів він хоче отримати прогноз погоди (
// Іноді параметр не працює, у такому випадку можна зробити пошук на один день).
// Приклад форми https://prnt.sc/kFmL0j6gBdv-

// Після сабміту форми відмалюй картки з інформацією, отриманою з бекенду.
// Картка має містити відомості про:
// 1. Зображення з погодою (icon)
// 2. Текст з погодою (text)
// 3. Дату (date)
// 4. Середню температуру в Цельсія (avgtemp_c)
// Приклад картки https://prnt.sc/h_p-A6Hty-i

const BASE_URL = "https://www.weatherapi.com/v1";
const API_KEY = "6410346f89264d6e919165208231505";
